---
kind: method
id: M:Autodesk.Revit.DB.IFCExportOptions.#ctor
source: html/eb0d7c98-5ede-aa81-61ed-bdb4810cc6a6.htm
---
# Autodesk.Revit.DB.IFCExportOptions.#ctor Method

Default constructor. Initializes FileVersion to Default.
 WallAndColumnSplitting and ExportBaseQuantities are set to false.
 FamilyMappingFile is set to empty.

## Syntax (C#)
```csharp
public IFCExportOptions()
```